# 07
Лабораторные работы 7.1 и 7.2. Вариант 8.<br>
Студент группы 3540904/10102:<br>
Мамадалиев Шерзод Рустам угли

## 7.1
Найти проблему в следующем исходном коде.

C:
```txt
01     double a[N], b[N];
02     a[0] = 2;
03
04 #pragma omp parallel for nowait
05     for (int i = 1; i < N; i++) {
06         a[i] = a[i - 1] * a[i - 1];
07         b[i] = a[i] + 1;
08         printf("1\n");
09     }
10     b[0] = a[N - 1];
```

### Ответы
Во первых, при компиляции данную программу, получим синтаксическую ошибку.
<br>
Во-вторых, бессмысленно использовать parallel и nowait для цикла в строке 04.
<br>

## 7.2
Используя формулы Крамера, найти решение системы линейных
уравнений.



Предусмотреть возможность деления на ноль. Входные данные: коэф-
фициенты системы. Оптимальное количество потоков выбрать самостоя-
тельно.
